// Основы разработки на C++: белый пояс. Вторая неделя
// Задание по программированию: Факториал
#include "Coursera_Yandex_White_Week02_Task_01_Factorial.h"
using namespace std;

int main()
{
	int n;
	cin >> n;
	cout << Factorial(n);
	return 0;
}
