// Основы разработки на C++: белый пояс. Первая неделя
// Задание по программированию: A + B (решение)
#include <iostream>
using namespace std;

int main() {
  int a, b;
  cin >> a >> b;
  cout << a + b;
  return 0;
}
